app/views/collections/index.html.erb

SELECT "collections".* FROM "collections" WHERE "collections"."gallery_id" = $1  [["gallery_id", 12]]
---

    <h1 class="clear"><%= @gallery.name %> <%= "Collection".pluralize(@collections.count > 1 ? 2 : 1 ) %></h1>

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
								<% else %>
	                <% item = Item.find(collection.thumbnail) %>