app/views/collections/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."collection_id" = $1  [["collection_id", 3]]
SELECT COUNT(*) FROM "items" WHERE "items"."collection_id" = $1  [["collection_id", 8]]
---
    <ul id="list-of-images">
      <% if @collection.items.count > 0 %>