app/views/users/show.html.erb

  <ul>
    <% gallery.collections.each do |collection| %>
---
SELECT "collections".* FROM "collections" WHERE "collections"."gallery_id" = $1  [["gallery_id", 4]]