app/controllers/collections_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def index
    @gallery = Gallery.find(params["gallery_id"])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
  	@gallery = Gallery.find(@collection.gallery_id)

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @gallery = Gallery.find(params["gallery_id"])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "collections" ("name", "thumbnail", "created_at", "updated_at", "gallery_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new Collection"], ["thumbnail", 1], ["created_at", 2017-03-17 23:20:26 UTC], ["updated_at", 2017-03-17 23:20:26 UTC], ["gallery_id", 1]]
---
  def create
    @gallery = Gallery.find(params["gallery_id"])
    @collection = @gallery.collections.build(collection_params)
    @collection.thumbnail = 9999

    respond_to do |format|
      if @collection.save

UPDATE "collections" SET "name" = $1, "gallery_id" = $2, "updated_at" = $3 WHERE "collections"."id" = $4  [["name", "All the Paper in the World"], ["gallery_id", 7], ["updated_at", 2017-03-27 02:15:10 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @collection.update(collection_params)

UPDATE "collections" SET "archive" = $1, "updated_at" = $2 WHERE "collections"."id" = $3  [["archive", true], ["updated_at", 2017-03-22 01:16:59 UTC], ["id", 9]]
---
  def archive
  	@collection.update_attribute(:archive, true)

DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 8]]
---
  def destroy
    gallery = @collection.gallery_id
    if @collection.destroy

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_collection
      @collection = Collection.find(params[:id])