app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Paper mache"], ["created_at", 2017-03-18 01:48:09 UTC], ["updated_at", 2017-03-18 01:48:09 UTC], ["user_id", 2]]
---
  def create
    @gallery = current_user.galleries.build(gallery_params)
    respond_to do |format|
      if @gallery.save

UPDATE "galleries" SET "archive" = $1, "updated_at" = $2 WHERE "galleries"."id" = $3  [["archive", true], ["updated_at", 2017-03-18 01:00:24 UTC], ["id", 6]]
---
  def archive
    @gallery.update_attribute(:archive, true)

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_gallery
      @gallery = Gallery.find(params[:id])