app/controllers/items_controller.rb

INSERT INTO "items" ("title", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["collection_id", 12], ["created_at", 2017-04-02 01:50:28 UTC], ["updated_at", 2017-04-02 01:50:28 UTC]]
---
  def create
    @item = @collection.items.build(item_params)
    respond_to do |format|
      if @item.save

UPDATE "items" SET "image_updated_at" = $1, "updated_at" = $2, "image_file_name" = $3 WHERE "items"."id" = $4  [["image_updated_at", 2017-03-28 18:40:57 UTC], ["updated_at", 2017-03-28 18:40:58 UTC], ["image_file_name", "12400493103_06aaa119e9_o.jpg"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_collection
      @collection = Collection.find(params["collection_id"])