app/controllers/users_controller.rb

SELECT  "galleries".* FROM "galleries" ORDER BY "galleries"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def show
  	@gallery = Gallery.active.first